balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F67J93.PIC
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="IPR3" edc:desc="" edc:impl="0x76" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-1111111" edc:name="IPR3" edc:nzwidth="0x8" edc:por="-1111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RTCCIP" edc:desc="" edc:mask="0x1" edc:name="RTCCIP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1IP" edc:desc="" edc:mask="0x1" edc:name="CCP1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2IP" edc:desc="" edc:mask="0x1" edc:name="CCP2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CTMUIP" edc:desc="" edc:mask="0x1" edc:name="CTMUIP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX2IP" edc:desc="" edc:mask="0x1" edc:name="TX2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC2IP" edc:desc="" edc:mask="0x1" edc:name="RC2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LCDIP" edc:desc="" edc:mask="0x1" edc:name="LCDIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnns-" edc:cname="EECON1" edc:desc="" edc:impl="0x1e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--u0x00-" edc:name="EECON1" edc:nzwidth="0x8" edc:por="0000x000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WR" edc:desc="" edc:mask="0x1" edc:name="WR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WREN" edc:desc="" edc:mask="0x1" edc:name="WREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WRERR" edc:desc="" edc:mask="0x1" edc:name="WRERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FREE" edc:desc="" edc:mask="0x1" edc:name="FREE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPROG" edc:desc="" edc:mask="0x1" edc:name="WPROG" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="wwwwwwww" edc:cname="EECON2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000x000" edc:name="EECON2" edc:nzwidth="0x8" edc:por="--------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EECON2" edc:desc="" edc:mask="0xff" edc:name="EECON2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-nnnn" edc:cname="LCDCON" edc:desc="" edc:impl="0xef" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0uu-uuuu" edc:name="LCDCON" edc:nzwidth="0x8" edc:por="0xx-xxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LMUX0" edc:desc="" edc:mask="0x1" edc:name="LMUX0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LMUX1" edc:desc="" edc:mask="0x1" edc:name="LMUX1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS0" edc:desc="" edc:mask="0x1" edc:name="CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:desc="" edc:mask="0x1" edc:name="CS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WERR" edc:desc="" edc:mask="0x1" edc:name="WERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLPEN" edc:desc="" edc:mask="0x1" edc:name="SLPEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LCDEN" edc:desc="" edc:mask="0x1" edc:name="LCDEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="LCDCS0" edc:desc="" edc:mask="0x1" edc:name="LCDCS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LCDCS1" edc:desc="" edc:mask="0x1" edc:name="LCDCS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LCDWERR" edc:desc="" edc:mask="0x1" edc:name="LCDWERR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LCDSLPEN" edc:desc="" edc:mask="0x1" edc:name="LCDSLPEN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDSE0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDSE0" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDSE0" edc:desc="" edc:mask="0xff" edc:name="LCDSE0" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SE0" edc:desc="" edc:mask="0x1" edc:name="SE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE1" edc:desc="" edc:mask="0x1" edc:name="SE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE2" edc:desc="" edc:mask="0x1" edc:name="SE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE3" edc:desc="" edc:mask="0x1" edc:name="SE3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE4" edc:desc="" edc:mask="0x1" edc:name="SE4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE5" edc:desc="" edc:mask="0x1" edc:name="SE5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE6" edc:desc="" edc:mask="0x1" edc:name="SE6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE7" edc:desc="" edc:mask="0x1" edc:name="SE7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEGEN0" edc:desc="" edc:mask="0x1" edc:name="SEGEN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN1" edc:desc="" edc:mask="0x1" edc:name="SEGEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN2" edc:desc="" edc:mask="0x1" edc:name="SEGEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN3" edc:desc="" edc:mask="0x1" edc:name="SEGEN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN4" edc:desc="" edc:mask="0x1" edc:name="SEGEN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN5" edc:desc="" edc:mask="0x1" edc:name="SEGEN5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN6" edc:desc="" edc:mask="0x1" edc:name="SEGEN6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEGEN7" edc:desc="" edc:mask="0x1" edc:name="SEGEN7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SE00" edc:desc="" edc:mask="0x1" edc:name="SE00" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE01" edc:desc="" edc:mask="0x1" edc:name="SE01" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE02" edc:desc="" edc:mask="0x1" edc:name="SE02" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE03" edc:desc="" edc:mask="0x1" edc:name="SE03" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE04" edc:desc="" edc:mask="0x1" edc:name="SE04" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE05" edc:desc="" edc:mask="0x1" edc:name="SE05" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE06" edc:desc="" edc:mask="0x1" edc:name="SE06" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SE07" edc:desc="" edc:mask="0x1" edc:name="SE07" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
